In [3]:
import numpy as np
import pandas as pd

In [6]:
data = pd.Series([.25, .5, .75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [7]:
print (data.values)

[0.25 0.5  0.75 1.  ]

In [4]:
print (data.index)

RangeIndex(start=0, stop=4, step=1)

In [5]:
print (data[3])

1.0

In [6]:
print (data[1:3])

1    0.50
2    0.75
dtype: float64

In [7]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])

In [8]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [12]:
CityPop = {'Denver': '2372343',
            'Seattle': '3473483',
            'Detroit': '8273782',
            'Washington': '2837327',
            'Baltimore': '1237834'}

In [14]:
print(CityPop)

{'Denver': '2372343', 'Seattle': '3473483', 'Detroit': '8273782', 'Washington': '2837327', 'Baltimore': '1237834'}

In [13]:
CitySeries = pd.Series(CityPop)
CitySeries

Denver        2372343
Seattle       3473483
Detroit       8273782
Washington    2837327
Baltimore     1237834
dtype: object

In [15]:
CitySeries['Detroit']

'8273782'

In [16]:
pd.Series([1, 10, 35, 45])

0     1
1    10
2    35
3    45
dtype: int64

In [17]:
pd.Series(10, index = [1000, 2000, 3000])

1000    10
2000    10
3000    10
dtype: int64

In [18]:
cars = np.array(['bmw', 'audi', 'ford', 'honda', 'chrysler', 'jeep'])
cars

array(['bmw', 'audi', 'ford', 'honda', 'chrysler', 'jeep'], dtype='<U8')

In [19]:
pd.Series(cars)

0         bmw
1        audi
2        ford
3       honda
4    chrysler
5        jeep
dtype: object

In [20]:
npnumbers = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
npnumbers

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [22]:
pdnumbers = pd.Series(npnumbers)
pdnumbers

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [31]:
CityArea = {'Denver': 43217,
           'Seattle': 63821,
           'Detroit': 87283,
           'Washington': 65321,
           'Baltimore': 18732}
CityArea

{'Denver': 43217,
 'Seattle': 63821,
 'Detroit': 87283,
 'Washington': 65321,
 'Baltimore': 18732}

In [32]:
CityAreaSeries = pd.Series(CityArea)
CityAreaSeries

Denver        43217
Seattle       63821
Detroit       87283
Washington    65321
Baltimore     18732
dtype: int64

In [33]:
CitySeries

Denver        2372343
Seattle       3473483
Detroit       8273782
Washington    2837327
Baltimore     1237834
dtype: object

In [34]:
CityAreaSeries

Denver        43217
Seattle       63821
Detroit       87283
Washington    65321
Baltimore     18732
dtype: int64

In [35]:
Cities = pd.DataFrame({'Population': CitySeries,
                     'Area': CityAreaSeries})
Cities

           Population   Area
Denver        2372343  43217
Seattle       3473483  63821
Detroit       8273782  87283
Washington    2837327  65321
Baltimore     1237834  18732

In [36]:
index1 = pd.Index([1,2,3,4,5])
index1

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [37]:
print(index1.size, index1.shape, index1.ndim, index1.dtype)

5 (5,) 1 int64

In [38]:
Cities['Area']['Denver']

43217

In [39]:
Cities['Population']['Washington']

'2837327'

In [ ]:
Pandas .loc Indexing Examples

In [40]:
Cities.loc['Seattle']

Population    3473483
Area            63821
Name: Seattle, dtype: object

In [41]:
Cities.loc['Denver']

Population    2372343
Area            43217
Name: Denver, dtype: object

In [42]:
Cities.loc['Washington']

Population    2837327
Area            65321
Name: Washington, dtype: object

In [43]:
Cities.loc['Denver':'Detroit']

        Population   Area
Denver     2372343  43217
Seattle    3473483  63821
Detroit    8273782  87283

In [48]:
Cities.loc[Cities['Area'] > 30000]

           Population   Area
Denver        2372343  43217
Seattle       3473483  63821
Detroit       8273782  87283
Washington    2837327  65321

In [49]:
Cities.loc[Cities['Area'] > 40000]

           Population   Area
Denver        2372343  43217
Seattle       3473483  63821
Detroit       8273782  87283
Washington    2837327  65321

In [50]:
Cities.loc[Cities['Area'] > 50000]

           Population   Area
Seattle       3473483  63821
Detroit       8273782  87283
Washington    2837327  65321

In [51]:
Cities.loc[Cities['Area'] > 60000]

           Population   Area
Seattle       3473483  63821
Detroit       8273782  87283
Washington    2837327  65321

In [52]:
Cities.loc[Cities['Area'] > 70000]

        Population   Area
Detroit    8273782  87283

In [ ]:
Pandas .iloc (Integer Positioning) Indexing Examples

In [53]:
Cities.iloc[0, 0]

'2372343'

In [54]:
Cities.iloc[2:4]

           Population   Area
Detroit       8273782  87283
Washington    2837327  65321

In [55]:
Cities.iloc[0:2]

        Population   Area
Denver     2372343  43217
Seattle    3473483  63821

In [56]:
Cities.iloc[0, :]

Population    2372343
Area            43217
Name: Denver, dtype: object

In [57]:
Cities.Area

Denver        43217
Seattle       63821
Detroit       87283
Washington    65321
Baltimore     18732
Name: Area, dtype: int64

In [58]:
Cities.Population

Denver        2372343
Seattle       3473483
Detroit       8273782
Washington    2837327
Baltimore     1237834
Name: Population, dtype: object

In [ ]:
#Check Pandas Version

In [5]:
import pandas
pandas.__version__

'1.1.3'

In [8]:
import pandas_datareader as pdr
tesla = pdr.get_data_yahoo('TSLA')

ModuleNotFoundError: No module named 'pandas_datareader'